ReFlo/micropython/ports/tm4c123/mods/timer.c
    if (n_args > 1 || n_kw > 0) {
        // start the peripheral
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
        machine_timer_init_helper(tim, n_args - 1, args + 1, &kw_args);
    }
    return (mp_obj_t)tim;
}

STATIC mp_obj_t machine_timer_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    return machine_timer_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_timer_init_obj, 1, machine_timer_init);

/******************************************************************************
 DEFINE PRIVATE DATA
 ******************************************************************************/

/******************************************************************************/

/******************************************************************************
 DEFINE PRIVATE FUNCTIONS
 ******************************************************************************/

STATIC void machine_timer_channel_irq_enable (mp_obj_t self_in) {
    machine_timer_channel_obj_t *self = self_in;
    MAP_TimerIntClear(self->timer->timer, self->timer->irq_trigger & self->channel);
    MAP_TimerIntEnable(self->timer->timer, self->timer->irq_trigger & self->channel);
}

STATIC void machine_timer_channel_irq_disable (mp_obj_t self_in) {
    machine_timer_channel_obj_t *self = self_in;
    MAP_TimerIntDisable(self->timer->timer, self->timer->irq_trigger & self->channel);
}

STATIC int machine_timer_channel_irq_flags (mp_obj_t self_in) {
    machine_timer_channel_obj_t *self = self_in;
    return self->timer->irq_flags;
}

STATIC machine_timer_channel_obj_t *machine_timer_channel_find (uint32_t timer, uint16_t channel_n) {
    for (mp_uint_t i = 0; i < MP_STATE_PORT(mp_timer_channel_obj_list).len; i++) {
        machine_timer_channel_obj_t *ch = ((machine_timer_channel_obj_t *)(MP_STATE_PORT(mp_timer_channel_obj_list).items[i]));
        // any 32-bit timer must be matched by any of its 16-bit versions
        if (ch->timer->timer == timer && ((ch->channel & TIMER_A) == channel_n || (ch->channel & TIMER_B) == channel_n)) {
            return ch;
        }
    }
    return MP_OBJ_NULL;
}

STATIC mp_obj_t machine_timer_channel_irq(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mp_arg_val_t args[mp_irq_INIT_NUM_ARGS];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, mp_irq_INIT_NUM_ARGS, mp_irq_init_args, args);
    machine_timer_channel_obj_t *ch = pos_args[0];

    // convert the priority to the correct value
    uint priority = args[1].u_int;

    // // validate the power mode
    // int pwrmode = (args[3].u_obj == mp_const_none) ? PYB_PWR_MODE_ACTIVE : mp_obj_get_int(args[3].u_obj);
    // if (pwrmode != PYB_PWR_MODE_ACTIVE) {
    //     goto invalid_args;
    // }

    // get the trigger
    uint trigger = mp_obj_get_int(args[0].u_obj);

    // disable the callback first
    machine_timer_channel_irq_disable(ch);

    uint8_t shift = (ch->channel == TIMER_B) ? 8 : 0;
    uint32_t _config = (ch->channel == TIMER_B) ? ((ch->timer->config & TIMER_B) >> 8) : (ch->timer->config & TIMER_A);
    switch (_config) {
    case TIMER_CFG_A_ONE_SHOT_UP:
    case TIMER_CFG_A_PERIODIC_UP:
        ch->timer->irq_trigger |= TIMER_TIMA_TIMEOUT << shift;
        if (trigger != PYBTIMER_TIMEOUT_TRIGGER) {
            goto invalid_args;
        }
        break;
    case TIMER_CFG_A_PWM:
        // special case for the PWM match interrupt
        ch->timer->irq_trigger |= ((ch->channel & TIMER_A) == TIMER_A) ? TIMER_TIMA_MATCH : TIMER_TIMB_MATCH;
        if (trigger != PYBTIMER_MATCH_TRIGGER) {
            goto invalid_args;
        }
        break;
    default:
        break;
    }
    // special case for a 32-bit timer
    if (ch->channel == (TIMER_A | TIMER_B)) {
       ch->timer->irq_trigger |= (ch->timer->irq_trigger << 8);
    }

    void (*pfnHandler)(void);
    uint32_t intregister;
    switch (ch->timer->timer) {
    case TIMER0_BASE:
        if (ch->channel == TIMER_B) {
            pfnHandler = &TIMER0BIntHandler;
            intregister = INT_TIMER0B;
        } else {
            pfnHandler = &TIMER0AIntHandler;
            intregister = INT_TIMER0A;
        }
        break;
    case TIMER1_BASE:
        if (ch->channel == TIMER_B) {
            pfnHandler = &TIMER1BIntHandler;
            intregister = INT_TIMER1B;
        } else {
            pfnHandler = &TIMER1AIntHandler;
            intregister = INT_TIMER1A;
        }
        break;
    case TIMER2_BASE:
        if (ch->channel == TIMER_B) {
            pfnHandler = &TIMER2BIntHandler;
            intregister = INT_TIMER2B;
        } else {
            pfnHandler = &TIMER2AIntHandler;
            intregister = INT_TIMER2A;
        }
        break;
    case TIMER3_BASE:
    if (ch->channel == TIMER_B) {
        pfnHandler = &TIMER3BIntHandler;
        intregister = INT_TIMER3B;
    } else {
        pfnHandler = &TIMER3AIntHandler;
        intregister = INT_TIMER2A;
    }
    break;
    case TIMER4_BASE:
    if (ch->channel == TIMER_B) {
        pfnHandler = &TIMER4BIntHandler;
        intregister = INT_TIMER4B;
    } else {
        pfnHandler = &TIMER4AIntHandler;
        intregister = INT_TIMER4A;
    }
    break;
    default:
        if (ch->channel == TIMER_B) {
            pfnHandler = &TIMER5BIntHandler;
            intregister = INT_TIMER5B;
        } else {
            pfnHandler = &TIMER3AIntHandler;
            intregister = INT_TIMER3A;
        }
        break;
    }

    // register the interrupt and configure the priority
    IntPrioritySet(intregister, priority);
    TimerIntRegister(ch->timer->timer, ch->channel, pfnHandler);

    // create the callback
    mp_obj_t _irq = mp_irq_new (ch, args[2].u_obj, &machine_timer_channel_irq_methods);

    // enable the callback before returning
    machine_timer_channel_irq_enable(ch);

    return _irq;

invalid_args:
    mp_raise_ValueError(MP_ERROR_TEXT("invalid argument(s) value"));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_timer_channel_irq_obj, 1, machine_timer_channel_irq);

STATIC void machine_timer_channel_remove (machine_timer_channel_obj_t *ch) {
    machine_timer_channel_obj_t *channel;
    if ((channel = machine_timer_channel_find(ch->timer->timer, ch->channel))) {
        mp_obj_list_remove(&MP_STATE_PORT(mp_timer_channel_obj_list), channel);
        // unregister it with the sleep module
    }
}

