ReFlo/micropython/ports/tm4c123/mods/timer.c
        }
    }
    // // add the timer to the list
    machine_timer_channel_add(ch);

    return ch;

error:
    mp_raise_ValueError(MP_ERROR_TEXT("invalid argument(s) value"));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_timer_channel_obj, 2, machine_timer_channel);

STATIC mp_obj_t machine_timer_deinit(mp_obj_t self_in) {
    machine_timer_obj_t *self = self_in;
    timer_disable(self);
    return mp_const_none;
}

STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_timer_deinit_obj, machine_timer_deinit);

// STATIC mp_obj_t machine_timer_channel_freq(size_t n_args, const mp_obj_t *args) {
//     machine_timer_channel_obj_t *ch = args[0];
//     if (n_args == 1) {
//         // get
//         return mp_obj_new_int(ch->frequency);
//     } else {
//         // set
//         int32_t _frequency = mp_obj_get_int(args[1]);
//         if (_frequency <= 0) {
//             mp_raise_ValueError(MP_ERROR_TEXT("invalid argument(s) value"));
//         }
//         ch->frequency = _frequency;
//         ch->period = 1000000 / _frequency;
//         machine_timer_channel_init(ch);
//         return mp_const_none;
//     }
// }
// STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_timer_channel_freq_obj, 1, 2, machine_timer_channel_freq);

void TIMERGenericIntHandler(uint32_t timer, uint16_t channel) {
    machine_timer_channel_obj_t *self;
    uint32_t status;
    if ((self = machine_timer_channel_find(timer, channel))) {
        status = MAP_TimerIntStatus(self->timer->timer, true) & self->channel;
        MAP_TimerIntClear(self->timer->timer, status);
        irq_handler(mp_irq_find(self));
    }
}



STATIC const mp_rom_map_elem_t machine_timer_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_init),                    MP_ROM_PTR(&machine_timer_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit),                  MP_ROM_PTR(&machine_timer_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_channel),                 MP_ROM_PTR(&machine_timer_channel_obj) },

    // class constants
    { MP_ROM_QSTR(MP_QSTR_A),                       MP_ROM_INT(TIMER_A) },
    { MP_ROM_QSTR(MP_QSTR_B),                       MP_ROM_INT(TIMER_B) },
    { MP_ROM_QSTR(MP_QSTR_ONE_SHOT),                MP_ROM_INT(TIMER_CFG_A_ONE_SHOT_UP) },
    { MP_ROM_QSTR(MP_QSTR_PERIODIC),                MP_ROM_INT(TIMER_CFG_A_PERIODIC_UP) },
    { MP_ROM_QSTR(MP_QSTR_PWM),                     MP_ROM_INT(TIMER_CFG_A_PWM) },
    { MP_ROM_QSTR(MP_QSTR_POSITIVE),                MP_ROM_INT(PYBTIMER_POLARITY_POS) },
    { MP_ROM_QSTR(MP_QSTR_NEGATIVE),                MP_ROM_INT(PYBTIMER_POLARITY_NEG) },
    { MP_ROM_QSTR(MP_QSTR_TIMEOUT),                 MP_ROM_INT(PYBTIMER_TIMEOUT_TRIGGER) },
    { MP_ROM_QSTR(MP_QSTR_MATCH),                   MP_ROM_INT(PYBTIMER_MATCH_TRIGGER) },
    };
STATIC MP_DEFINE_CONST_DICT(machine_timer_locals_dict, machine_timer_locals_dict_table);


const mp_obj_type_t machine_timer_type = {
    { &mp_type_type },
    .name = MP_QSTR_Timer,
    // .print = machine_timer_print,
    .make_new = machine_timer_make_new,
    .locals_dict = (mp_obj_t)&machine_timer_locals_dict,
};


STATIC const mp_irq_methods_t machine_timer_channel_irq_methods = {
    .init = machine_timer_channel_irq,
    .enable = machine_timer_channel_irq_enable,
    .disable = machine_timer_channel_irq_disable,
    .flags = machine_timer_channel_irq_flags,
};

STATIC const mp_rom_map_elem_t machine_timer_channel_locals_dict_table[] = {
    // instance methods
    //  { MP_ROM_QSTR(MP_QSTR_freq),                 MP_ROM_PTR(&machine_timer_channel_freq_obj) },
    //  { MP_ROM_QSTR(MP_QSTR_period),               MP_ROM_PTR(&machine_timer_channel_period_obj) },
    //  { MP_ROM_QSTR(MP_QSTR_duty_cycle),           MP_ROM_PTR(&machine_timer_channel_duty_cycle_obj) },
    { MP_ROM_QSTR(MP_QSTR_irq),                  MP_ROM_PTR(&machine_timer_channel_irq_obj) },
};
STATIC MP_DEFINE_CONST_DICT(machine_timer_channel_locals_dict, machine_timer_channel_locals_dict_table);


STATIC const mp_obj_type_t machine_timer_channel_type = {
    { &mp_type_type },
    .name = MP_QSTR_TimerChannel,
    // .print = machine_timer_channel_print,
    .locals_dict = (mp_obj_t)&machine_timer_channel_locals_dict,
};